In [2]:
import numpy as np

In [4]:
np.sum(np.array([1,2,3,4,5,6,7]))

28

In [1]:
from numpy import sum,array

In [6]:
sum(array([1,3,4,5,6,7]))

26

### today agenda

In [ ]:
- pandas
   ->series
   ->dataframes

In [37]:
import pandas as pd
import numpy as np

In [12]:
pd.__version__

'1.1.3'

In [9]:
print(dir(pd))

['BooleanDtype', 'Categorical', 'CategoricalDtype', 'CategoricalIndex', 'DataFrame', 'DateOffset', 'DatetimeIndex', 'DatetimeTZDtype', 'ExcelFile', 'ExcelWriter', 'Float64Index', 'Grouper', 'HDFStore', 'Index', 'IndexSlice', 'Int16Dtype', 'Int32Dtype', 'Int64Dtype', 'Int64Index', 'Int8Dtype', 'Interval', 'IntervalDtype', 'IntervalIndex', 'MultiIndex', 'NA', 'NaT', 'NamedAgg', 'Period', 'PeriodDtype', 'PeriodIndex', 'RangeIndex', 'Series', 'SparseDtype', 'StringDtype', 'Timedelta', 'TimedeltaIndex', 'Timestamp', 'UInt16Dtype', 'UInt32Dtype', 'UInt64Dtype', 'UInt64Index', 'UInt8Dtype', '__builtins__', '__cached__', '__doc__', '__docformat__', '__file__', '__getattr__', '__git_version__', '__loader__', '__name__', '__package__', '__path__', '__spec__', '__version__', '_config', '_hashtable', '_is_numpy_dev', '_lib', '_libs', '_np_version_under1p16', '_np_version_under1p17', '_np_version_under1p18', '_testing', '_tslib', '_typing', '_version', 'api', 'array', 'arrays', 'bdate_range', 'compat', 'concat', 'core', 'crosstab', 'cut', 'date_range', 'describe_option', 'errors', 'eval', 'factorize', 'get_dummies', 'get_option', 'infer_freq', 'interval_range', 'io', 'isna', 'isnull', 'json_normalize', 'lreshape', 'melt', 'merge', 'merge_asof', 'merge_ordered', 'notna', 'notnull', 'offsets', 'option_context', 'options', 'pandas', 'period_range', 'pivot', 'pivot_table', 'plotting', 'qcut', 'read_clipboard', 'read_csv', 'read_excel', 'read_feather', 'read_fwf', 'read_gbq', 'read_hdf', 'read_html', 'read_json', 'read_orc', 'read_parquet', 'read_pickle', 'read_sas', 'read_spss', 'read_sql', 'read_sql_query', 'read_sql_table', 'read_stata', 'read_table', 'reset_option', 'set_eng_float_format', 'set_option', 'show_versions', 'test', 'testing', 'timedelta_range', 'to_datetime', 'to_numeric', 'to_pickle', 'to_timedelta', 'tseries', 'unique', 'util', 'value_counts', 'wide_to_long']

In [11]:
print(len(dir(pd)))

140

## pandas

In [1]:
import pandas as pd
import numpy as np

## Hands on!

In [16]:
mydata=np.arange(30,100)
print(mydata)

[30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53
 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77
 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99]

In [18]:
mydata=np.arange(30,101,10)
print(mydata)

[ 30  40  50  60  70  80  90 100]

# In millions

In [19]:
mypop_data=pd.Series(mydata)
print(mypop_data)

0     30
1     40
2     50
3     60
4     70
5     80
6     90
7    100
dtype: int32

In [20]:
mypop_data.name="population"

In [23]:
mypop_data.dtype

dtype('int32')

In [24]:
mypop_data[0]

30

In [25]:
mypop_data[1:2]

1    40
Name: population, dtype: int32

In [22]:
mypop_data.name

'population'

In [28]:
g7_pop=pd.Series([35.467,63.456,67.134,42.685,93.578,12.578])

In [29]:
type(g7_pop.values)

numpy.ndarray

In [31]:
g7_pop.index

RangeIndex(start=0, stop=6, step=1)

In [33]:
mypop_data.index=['a','b','c','d','e','f','g','h']

In [34]:
mypop_data

a     30
b     40
c     50
d     60
e     70
f     80
g     90
h    100
Name: population, dtype: int32

In [4]:
r=pd.Series(np.array([1,2,3,4,5,6]),index=['a','b','c','d','e','f'],name='rol no',dtype='float')

In [5]:
r

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
f    6.0
Name: rol no, dtype: float64

In [8]:
d={'hansika':91,'poojitha':92,'vidya':95,'jyo':98}
d.items()

dict_items([('hansika', 91), ('poojitha', 92), ('vidya', 95), ('jyo', 98)])

In [9]:
d.values()

dict_values([91, 92, 95, 98])

In [10]:
d.keys()

dict_keys(['hansika', 'poojitha', 'vidya', 'jyo'])

In [13]:
marks=pd.Series(d,name='s marks',dtype='str')
print(marks)

hansika     91
poojitha    92
vidya       95
jyo         98
Name: s marks, dtype: object

In [19]:
marks[['hansika','vidya','poojitha']]

hansika     91
vidya       95
poojitha    92
Name: s marks, dtype: object

In [20]:
marks['hansika':'jyo']

hansika     91
poojitha    92
vidya       95
jyo         98
Name: s marks, dtype: object

In [27]:
# iloc-it defines index values
# loc-it defines index positions
marks.iloc[0:5]

hansika     91
poojitha    92
vidya       95
jyo         98
Name: s marks, dtype: object

In [24]:
marks.loc['jyo']

'98'

In [25]:
marks.loc['vidya':'jyo']

vidya    95
jyo      98
Name: s marks, dtype: object

In [29]:
import random

In [37]:
random.randint(1,10)

1

In [39]:
b=pd.Series(np.array([5,6,7,8,9,1,2,3,4,5,6]),index=list('ABCDEFGHIJK'),name='grades')
b

A    5
B    6
C    7
D    8
E    9
F    1
G    2
H    3
I    4
J    5
K    6
Name: grades, dtype: int32

In [40]:
b>6

A    False
B    False
C     True
D     True
E     True
F    False
G    False
H    False
I    False
J    False
K    False
Name: grades, dtype: bool

In [41]:
b[b>6]

C    7
D    8
E    9
Name: grades, dtype: int32

In [42]:
b*10

A    50
B    60
C    70
D    80
E    90
F    10
G    20
H    30
I    40
J    50
K    60
Name: grades, dtype: int32

In [43]:
b.mean()

5.090909090909091

In [46]:
b['A':'C'].mean()

6.0

In [47]:
(5+6+7)/3

6.0

In [48]:
b['A']=10

In [49]:
b

A    10
B     6
C     7
D     8
E     9
F     1
G     2
H     3
I     4
J     5
K     6
Name: grades, dtype: int32

In [ ]:
- probably the most important data structure of pandas 
is the DataFrame.It is a tabular structure tightly 
integrated with series.

In [55]:
ms_marks={'sub1':[99,98,97,96,95,94,93,92,91,90],
         'sub2':[65,67,66,68,69,70,61,99,62,77],
         'sub3':[11,12,13,14,15,16,17,18,19,20],
         'sub4':[21,22,23,24,52,62,72,88,29,26]}

In [60]:
marks=pd.DataFrame(ms_marks,index=['hansi','vidhyu','pooji','jyo','priya','riya','lucky','a','b','c'])
marks

        sub1  sub2  sub3  sub4
hansi     99    65    11    21
vidhyu    98    67    12    22
pooji     97    66    13    23
jyo       96    68    14    24
priya     95    69    15    52
riya      94    70    16    62
lucky     93    61    17    72
a         92    99    18    88
b         91    62    19    29
c         90    77    20    26

In [75]:
marks.loc['hansi'].sum()

196

In [78]:
marks.loc[['hansi','pooji']].sum()

sub1    196
sub2    131
sub3     24
sub4     44
dtype: int64

In [79]:
marks.index

Index(['hansi', 'vidhyu', 'pooji', 'jyo', 'priya', 'riya', 'lucky', 'a', 'b',
       'c'],
      dtype='object')

In [81]:
marks.columns

Index(['sub1', 'sub2', 'sub3', 'sub4'], dtype='object')

In [82]:
marks.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, hansi to c
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sub1    10 non-null     int64
 1   sub2    10 non-null     int64
 2   sub3    10 non-null     int64
 3   sub4    10 non-null     int64
dtypes: int64(4)
memory usage: 720.0+ bytes

In [84]:
marks.size

40

In [88]:
marks.shape

(10, 4)

In [90]:
marks.describe()

           sub1       sub2      sub3       sub4
count  10.00000  10.000000  10.00000  10.000000
mean   94.50000  70.400000  15.50000  41.900000
std     3.02765  10.996969   3.02765  24.646163
min    90.00000  61.000000  11.00000  21.000000
25%    92.25000  65.250000  13.25000  23.250000
50%    94.50000  67.500000  15.50000  27.500000
75%    96.75000  69.750000  17.75000  59.500000
max    99.00000  99.000000  20.00000  88.000000

In [92]:
marks.describe

<bound method NDFrame.describe of         sub1  sub2  sub3  sub4
hansi     99    65    11    21
vidhyu    98    67    12    22
pooji     97    66    13    23
jyo       96    68    14    24
priya     95    69    15    52
riya      94    70    16    62
lucky     93    61    17    72
a         92    99    18    88
b         91    62    19    29
c         90    77    20    26>

In [95]:
marks[['sub1','sub2']]

        sub1  sub2
hansi     99    65
vidhyu    98    67
pooji     97    66
jyo       96    68
priya     95    69
riya      94    70
lucky     93    61
a         92    99
b         91    62
c         90    77

In [99]:
marks[['sub1','sub4']]

        sub1  sub4
hansi     99    21
vidhyu    98    22
pooji     97    23
jyo       96    24
priya     95    52
riya      94    62
lucky     93    72
a         92    88
b         91    29
c         90    26

In [103]:
marks['sub2']>70

hansi     False
vidhyu    False
pooji     False
jyo       False
priya     False
riya      False
lucky     False
a          True
b         False
c          True
Name: sub2, dtype: bool

In [106]:
marks[marks>70]

        sub1  sub2  sub3  sub4
hansi     99   NaN   NaN   NaN
vidhyu    98   NaN   NaN   NaN
pooji     97   NaN   NaN   NaN
jyo       96   NaN   NaN   NaN
priya     95   NaN   NaN   NaN
riya      94   NaN   NaN   NaN
lucky     93   NaN   NaN  72.0
a         92  99.0   NaN  88.0
b         91   NaN   NaN   NaN
c         90  77.0   NaN   NaN

In [111]:
marks.sub1['lucky']

93

In [112]:
marks.sub2['lucky']

61

In [115]:
marks.sub1[['pooji','hansi']]

pooji    97
hansi    99
Name: sub1, dtype: int64

In [116]:
marks.sub4['priya']

52

In [117]:
marks.iloc[0][0:3]

sub1    99
sub2    65
sub3    11
Name: hansi, dtype: int64

In [118]:
marks

        sub1  sub2  sub3  sub4
hansi     99    65    11    21
vidhyu    98    67    12    22
pooji     97    66    13    23
jyo       96    68    14    24
priya     95    69    15    52
riya      94    70    16    62
lucky     93    61    17    72
a         92    99    18    88
b         91    62    19    29
c         90    77    20    26

In [119]:
marks.iloc[3]

sub1    96
sub2    68
sub3    14
sub4    24
Name: jyo, dtype: int64

In [120]:
marks.iloc[3][0]

96

In [121]:
marks.iloc[3][2:5]

sub3    14
sub4    24
Name: jyo, dtype: int64

In [122]:
marks.iloc[5][6:9]

Series([], Name: riya, dtype: int64)

In [124]:
marks['sub5']=[1,2,3,4,5,6,7,8,9,0]

In [125]:
marks

        sub1  sub2  sub3  sub4  sub5
hansi     99    65    11    21     1
vidhyu    98    67    12    22     2
pooji     97    66    13    23     3
jyo       96    68    14    24     4
priya     95    69    15    52     5
riya      94    70    16    62     6
lucky     93    61    17    72     7
a         92    99    18    88     8
b         91    62    19    29     9
c         90    77    20    26     0

In [127]:
# how to drop columns
marks.drop(columns='sub5')

        sub1  sub2  sub3  sub4
hansi     99    65    11    21
vidhyu    98    67    12    22
pooji     97    66    13    23
jyo       96    68    14    24
priya     95    69    15    52
riya      94    70    16    62
lucky     93    61    17    72
a         92    99    18    88
b         91    62    19    29
c         90    77    20    26

In [130]:
marks.drop(columns=['sub5','sub4','sub3'])

        sub1  sub2
hansi     99    65
vidhyu    98    67
pooji     97    66
jyo       96    68
priya     95    69
riya      94    70
lucky     93    61
a         92    99
b         91    62
c         90    77

In [131]:
marks

        sub1  sub2  sub3  sub4  sub5
hansi     99    65    11    21     1
vidhyu    98    67    12    22     2
pooji     97    66    13    23     3
jyo       96    68    14    24     4
priya     95    69    15    52     5
riya      94    70    16    62     6
lucky     93    61    17    72     7
a         92    99    18    88     8
b         91    62    19    29     9
c         90    77    20    26     0

In [132]:
marks.drop(columns='sub5',axis=1)

        sub1  sub2  sub3  sub4
hansi     99    65    11    21
vidhyu    98    67    12    22
pooji     97    66    13    23
jyo       96    68    14    24
priya     95    69    15    52
riya      94    70    16    62
lucky     93    61    17    72
a         92    99    18    88
b         91    62    19    29
c         90    77    20    26

In [133]:
marks

        sub1  sub2  sub3  sub4  sub5
hansi     99    65    11    21     1
vidhyu    98    67    12    22     2
pooji     97    66    13    23     3
jyo       96    68    14    24     4
priya     95    69    15    52     5
riya      94    70    16    62     6
lucky     93    61    17    72     7
a         92    99    18    88     8
b         91    62    19    29     9
c         90    77    20    26     0

In [134]:
# drop columns permanently from dataframes using inplace
marks.drop(columns='sub5',axis=1,inplace=True)

In [135]:
marks

        sub1  sub2  sub3  sub4
hansi     99    65    11    21
vidhyu    98    67    12    22
pooji     97    66    13    23
jyo       96    68    14    24
priya     95    69    15    52
riya      94    70    16    62
lucky     93    61    17    72
a         92    99    18    88
b         91    62    19    29
c         90    77    20    26

In [136]:
marks.drop(columns='sub4',axis=1,inplace=False)

        sub1  sub2  sub3
hansi     99    65    11
vidhyu    98    67    12
pooji     97    66    13
jyo       96    68    14
priya     95    69    15
riya      94    70    16
lucky     93    61    17
a         92    99    18
b         91    62    19
c         90    77    20

In [138]:
marks.drop('priya')

        sub1  sub2  sub3  sub4
hansi     99    65    11    21
vidhyu    98    67    12    22
pooji     97    66    13    23
jyo       96    68    14    24
riya      94    70    16    62
lucky     93    61    17    72
a         92    99    18    88
b         91    62    19    29
c         90    77    20    26

In [139]:
marks

        sub1  sub2  sub3  sub4
hansi     99    65    11    21
vidhyu    98    67    12    22
pooji     97    66    13    23
jyo       96    68    14    24
priya     95    69    15    52
riya      94    70    16    62
lucky     93    61    17    72
a         92    99    18    88
b         91    62    19    29
c         90    77    20    26

In [144]:
marks.iloc[6][2]=99

In [145]:
marks

        sub1  sub2  sub3  sub4
hansi     99    65    11    21
vidhyu    98    67    12    22
pooji     97    66    13    23
jyo       96    68    14    24
priya     95    69    15    52
riya      94    70    16    62
lucky     93    61    99    72
a         92    99    18    88
b         91    62    19    29
c         90    77    20    26

In [152]:
marks.sub3[0:10]=100

In [153]:
marks

        sub1  sub2  sub3  sub4
hansi     99    65   100    21
vidhyu    98    67   100    22
pooji     97    66   100    23
jyo       96    68   100    24
priya     95    69   100    52
riya      94    70   100    62
lucky     93    61   100    72
a         92    99   100    88
b         91    62   100    29
c         90    77   100    26

In [162]:
marks.sub3[0:10]

hansi     100
vidhyu    100
pooji     100
jyo       100
priya     100
riya      100
lucky     100
a         100
b         100
c         100
Name: sub3, dtype: int64

In [161]:
marks

        sub1  sub2  sub3  sub4
hansi    100   100   100   100
vidhyu   100   100   100   100
pooji    100   100   100   100
jyo      100   100   100   100
priya    100   100   100   100
riya     100   100   100   100
lucky    100   100   100   100
a        100   100   100   100
b        100   100   100   100
c        100   100   100   100

In [163]:
marks

        sub1  sub2  sub3  sub4
hansi    100   100   100   100
vidhyu   100   100   100   100
pooji    100   100   100   100
jyo      100   100   100   100
priya    100   100   100   100
riya     100   100   100   100
lucky    100   100   100   100
a        100   100   100   100
b        100   100   100   100
c        100   100   100   100

In [164]:
import pandas as pd

In [166]:
# real csv data from external files using read_csv function
pop_data=pd.read_csv('population.csv')

In [167]:
pop_data

    2001   2002  2003  2004  2005  2006  2007   2008  2009  2010
0     91   91.5    90    95    97    98    99   95.5    92    91
1    120  121.0   122   123   124   125   126  127.0   128   129
2     91   91.5    90    95    97    98    99   95.5    92    91
3    120  121.0   122   123   124   125   126  127.0   128   129
4     91   91.5    90    95    97    98    99   95.5    92    91
5    120  121.0   122   123   124   125   126  127.0   128   129
6     91   91.5    90    95    97    98    99   95.5    92    91
7    120  121.0   122   123   124   125   126  127.0   128   129
8     91   91.5    90    95    97    98    99   95.5    92    91
9    120  121.0   122   123   124   125   126  127.0   128   129
10    91   91.5    90    95    97    98    99   95.5    92    91
11   120  121.0   122   123   124   125   126  127.0   128   129

In [168]:
pop_data.shape

(12, 10)

In [169]:
pop_data.index

RangeIndex(start=0, stop=12, step=1)

In [170]:
pop_data.values

array([[ 91. ,  91.5,  90. ,  95. ,  97. ,  98. ,  99. ,  95.5,  92. ,
         91. ],
       [120. , 121. , 122. , 123. , 124. , 125. , 126. , 127. , 128. ,
        129. ],
       [ 91. ,  91.5,  90. ,  95. ,  97. ,  98. ,  99. ,  95.5,  92. ,
         91. ],
       [120. , 121. , 122. , 123. , 124. , 125. , 126. , 127. , 128. ,
        129. ],
       [ 91. ,  91.5,  90. ,  95. ,  97. ,  98. ,  99. ,  95.5,  92. ,
         91. ],
       [120. , 121. , 122. , 123. , 124. , 125. , 126. , 127. , 128. ,
        129. ],
       [ 91. ,  91.5,  90. ,  95. ,  97. ,  98. ,  99. ,  95.5,  92. ,
         91. ],
       [120. , 121. , 122. , 123. , 124. , 125. , 126. , 127. , 128. ,
        129. ],
       [ 91. ,  91.5,  90. ,  95. ,  97. ,  98. ,  99. ,  95.5,  92. ,
         91. ],
       [120. , 121. , 122. , 123. , 124. , 125. , 126. , 127. , 128. ,
        129. ],
       [ 91. ,  91.5,  90. ,  95. ,  97. ,  98. ,  99. ,  95.5,  92. ,
         91. ],
       [120. , 121. , 122. , 123. , 124. , 125. , 126. , 127. , 128. ,
        129. ]])

In [171]:
pop_data.columns

Index(['2001', '2002', '2003', '2004', '2005', '2006', '2007', '2008', '2009',
       '2010'],
      dtype='object')

In [173]:
pop_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   2001    12 non-null     int64
 1   2002    12 non-null     float64
 2   2003    12 non-null     int64
 3   2004    12 non-null     int64
 4   2005    12 non-null     int64
 5   2006    12 non-null     int64
 6   2007    12 non-null     int64
 7   2008    12 non-null     float64
 8   2009    12 non-null     int64
 9   2010    12 non-null     int64
dtypes: float64(2), int64(8)
memory usage: 1.1 KB

In [177]:
pop_data.columns

Index(['2001', '2002', '2003', '2004', '2005', '2006', '2007', '2008', '2009',
       '2010'],
      dtype='object')

In [191]:
pop_data.index=['india','chaina','england','australia','northkorea','america'
                ,'japan','bangladesh',
                'southkorea','pakistan','paris','bankok']

In [192]:
pop_data

            2001   2002  2003  2004  2005  2006  2007   2008  2009  2010
india         91   91.5    90    95    97    98    99   95.5    92    91
chaina       120  121.0   122   123   124   125   126  127.0   128   129
england       91   91.5    90    95    97    98    99   95.5    92    91
australia    120  121.0   122   123   124   125   126  127.0   128   129
northkorea    91   91.5    90    95    97    98    99   95.5    92    91
america      120  121.0   122   123   124   125   126  127.0   128   129
japan         91   91.5    90    95    97    98    99   95.5    92    91
bangladesh   120  121.0   122   123   124   125   126  127.0   128   129
southkorea    91   91.5    90    95    97    98    99   95.5    92    91
pakistan     120  121.0   122   123   124   125   126  127.0   128   129
paris         91   91.5    90    95    97    98    99   95.5    92    91
bankok       120  121.0   122   123   124   125   126  127.0   128   129

In [195]:
marks=pd.read_excel('marks.xlsx')

In [196]:
marks

   s.no  mad  gcc  sa  ms  spm  is
0     1   99   65  65  98   88  65
1     2   98   56  43  87   77  84
2     3   97   22  54  76   66  89
3     4   96   54  22  54   98  56
4     5   95   66  98  78   76  56
5     6   93   88  54  56   45  98